<template><div><h1 id="view-layers" tabindex="-1"><a class="header-anchor" href="#view-layers"><span>view-layers</span></a></h1>
<h2 id="описание" tabindex="-1"><a class="header-anchor" href="#описание"><span>Описание</span></a></h2>
<p>Представляет собой плагин управления диалоговыми компонентами. Незаменимый помощник для быстрой отрисовки окон поверх друг друга. Он рендерит и запоминает список виртуальных компонентов. Индекс слоя определяет его z-index в контейнере слоёв. Количество слоёв окон не ограничено.<br>
Если вам нужно наслоение окон, например <strong>Дровер -&gt; Модальное окно -&gt; подтверждение действия</strong>, он справится со своей задачей без нагромождения лишних состояний. Цепочка вызовов будет наглядно описывать пользовательские пути, а открытие и закрытие окон можно производить откуда угодно в контексте приложения не беспокоясь за область видимости.</p>
<h2 id="примеры" tabindex="-1"><a class="header-anchor" href="#примеры"><span>Примеры</span></a></h2>
<p>В разработке</p>
</div></template>


